---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorManyDirectionCurves
source: html/34943a28-84cf-55fa-962e-b0e313e2e257.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.FloorManyDirectionCurves Property

More than one span direction curve specified.

## Syntax (C#)
```csharp
public static FailureDefinitionId FloorManyDirectionCurves { get; }
```